In [1]:
import pandas as pd

titanic = pd.read_csv('titanic.csv')

In [2]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [7]:
age = titanic['age']
type(age)

pandas.core.series.Series

In [8]:
age.shape

(891,)

In [10]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [11]:
age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [12]:
age.to_frame()

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [13]:
age.tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, dtype: float64

In [15]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [18]:
age.sum(skipna=False)

nan

In [20]:
len(age.unique())

89

In [22]:
age.nunique(dropna=False)

89

In [24]:
age.value_counts(dropna=False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: age, Length: 89, dtype: int64

In [25]:
age.value_counts(ascending=True)

74.0     1
14.5     1
70.5     1
12.0     1
36.5     1
        ..
30.0    25
19.0    25
18.0    26
22.0    27
24.0    30
Name: age, Length: 88, dtype: int64

In [28]:
age.value_counts(sort=True,dropna=False, ascending=False, normalize=True)

NaN      0.198653
24.00    0.033670
22.00    0.030303
18.00    0.029181
28.00    0.028058
           ...
36.50    0.001122
55.50    0.001122
0.92     0.001122
23.50    0.001122
74.00    0.001122
Name: age, Length: 89, dtype: float64

In [30]:
age.value_counts(sort=True,dropna=False, ascending=False, normalize=True,bins= 5)

(16.336, 32.252]    0.388328
(32.252, 48.168]    0.210999
(0.339, 16.336]     0.112233
(48.168, 64.084]    0.077441
(64.084, 80.0]      0.012346
Name: age, dtype: float64

In [31]:
summer = pd.read_csv('summer.csv')
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [32]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [34]:
athlete = summer['Athlete']

In [36]:
athlete.count()

31165

In [39]:
athlete.value_counts(sort = True, ascending=False, normalize=True).head()

PHELPS, Michael         0.000706
LATYNINA, Larisa        0.000578
ANDRIANOV, Nikolay      0.000481
ONO, Takashi            0.000417
MANGIAROTTI, Edoardo    0.000417
Name: Athlete, dtype: float64

C:\Users\clack\AppData\Local\Temp\ipykernel_17916\2031691219.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [42]:
pd.read_csv('summer.csv',usecols=['Athlete'],squeeze=True)

C:\Users\clack\AppData\Local\Temp\ipykernel_17916\2986865610.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  pd.read_csv('summer.csv',usecols=['Athlete'],squeeze=True)

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

**Creating from scratcch with pd.Series**

In [43]:
pd.Series([10,25,6,36,2])

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [45]:
pd.Series([10,25,6,36,2], index = ['Mon','Tue','Wed','Thu','Fri'], name = 'Sales')

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
Name: Sales, dtype: int64

In [46]:
import pandas as pd
import numpy as np
sales = np.array([10,25,6,36,2])
sales

array([10, 25,  6, 36,  2])

In [47]:
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int32

In [48]:
sales = [10,25,6,36,2]
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int64

**From Dictionary**

In [49]:
dic = {"Mon":10, "Tue":25, 'Wed':6,'Thu':36, 'Fri':2}
pd.Series(dic)

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [55]:
sales = pd.Series(sales)
d = pd.Series(dic)
d.sort_index(ascending=True)

Fri     2
Mon    10
Thu    36
Tue    25
Wed     6
dtype: int64

In [58]:
age.nlargest(4)

630    80.0
851    74.0
96     71.0
493    71.0
Name: age, dtype: float64

In [59]:
age.nsmallest(4)

803    0.42
755    0.67
469    0.75
644    0.75
Name: age, dtype: float64

In [66]:
age.idxmax()

630

In [64]:
age.idxmin()

803

In [67]:
titanic.loc[630]

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [73]:
summer = pd.read_csv('summer.csv', index_col= 'Athlete')

In [76]:
summer.index[0]

'HAJOS, Alfred'

**Creating index objects**

In [77]:
list_1 = [1,2,3]
pd.Index(list_1)

Int64Index([1, 2, 3], dtype='int64')

In [79]:
list_2 = ['m','t','w']
pd.Index(list_2)

Index(['m', 't', 'w'], dtype='object')

In [81]:
index_1 = pd.Index(range(1,4))
index_1

RangeIndex(start=1, stop=4, step=1)

In [82]:
index_2 = pd.Index(['Mo','Tue','Wed'], name = 'days')
index_2

Index(['Mo', 'Tue', 'Wed'], dtype='object', name='days')

In [83]:
pd.Series([34,32,21],index = index_1)

1    34
2    32
3    21
dtype: int64

In [85]:
summer.reset_index(drop=True)

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

In [87]:
summer.set_index('Year',drop=False)

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Year,,,,,,,,
1896,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1896,1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
1896,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
1896,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
1896,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...
2012,2012,London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
2012,2012,London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
2012,2012,London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
2012,2012,London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
2012,2012,London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze